app/controllers/schoolclasses_controller.rb

SELECT "schoolclasses".* FROM "schoolclasses"
---
  def index
    @schoolclasses = Schoolclass.all

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @schoolclass = Schoolclass.find(params[:id])

INSERT INTO "schoolclasses" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "science"], ["room_number", 10], ["created_at", "2018-10-15 14:48:06.367647"], ["updated_at", "2018-10-15 14:48:06.367647"]]
---
  def create
    @schoolclass = Schoolclass.new(params.require(:schoolclass))
    @schoolclass.save

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
      @schoolclass = Schoolclass.find(params[:id])

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schoolclasses" SET "room_number" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["room_number", 11], ["updated_at", "2018-10-15 14:57:07.053401"], ["id", 1]]
---
    def update
      @schoolclass = Schoolclass.find(params[:id])
      @schoolclass.update(params.require(:schoolclass))