app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @schoolclasses = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Woodwork"], ["room_number", 123], ["created_at", "2018-10-16 12:50:55.247133"], ["updated_at", "2018-10-16 12:50:55.247133"]]
---
  def create
    @schoolclass = SchoolClass.create(params_school_class)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Skate Class"], ["room_number", 12345], ["updated_at", "2018-10-16 14:44:08.984904"], ["id", 3]]
---
  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(params_school_class)

DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 5]]
---
  def destroy
    @schoolclass.destroy

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 5]]
---
  def set_school_class
    @schoolclass = SchoolClass.find(params[:id])