app/controllers/students_controller.rb

INSERT INTO "students" ("last_name", "first_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["last_name", "Smith"], ["first_name", "Bill"], ["created_at", "2018-10-15 13:21:19.617175"], ["updated_at", "2018-10-15 13:21:19.617175"]]
---
  def create
    @student = Student.create(params_student)

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "nkosi"], ["last_name", "phillip"], ["updated_at", "2018-10-15 13:58:06.581323"], ["id", 1]]
---
  def update
    @student.update(params_student)